Revit 2027 API
FacetingUtils Class
 This class is used to convertTrianglesToQuads a triangulated structure into a structure in which some of the triangles have been consolidated into quadrilaterals.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FacetingUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class FacetingUtils
Public NotInheritable Class FacetingUtils
public ref class FacetingUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FacetingUtils = class end
The FacetingUtils type exposes the following members.
Methods
Name | Description
ConvertTrianglesToQuads |  Replaces pairs of adjacent, coplanar triangles by quadrilaterals.
Top
See Also
Reference
Autodesk.Revit.DB Namespace